SIPI_интернет-магазин/src/Documents/РеализацияТовары/РеализацияТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТовары</name>
  <basedOn>Catalog.Клиенты</basedOn>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>CatalogRef.Размеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SIPI_интернет-магазин/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SIPI_интернет-магазин/src/Documents/РеализацияТовары/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиЭлементовТабличнойЧастиТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры    

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.Цена = ПолучитьЦену(ТекДанные.Номенклатура, объект.Дата)  * (1 + Наценка/100);  
	РассчитатьСумму();
КонецПроцедуры   

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСумму()
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьЦену(Товар, Дата)
	Возврат РегистрыСведений.Цены.ПолучитьПоследнее(Дата, Новый Структура("Товар",Товар )).цена 
КонецФункции

&НаСервереБезКонтекста
Функция КонтрагентПриИзмененииНаСервере(Контрагент)
	Возврат Контрагент.ЧерныйСписок
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если КонтрагентПриИзмененииНаСервере(Объект.Контрагент) тогда
		Сообщить(СтрШаблон("Поставщик %1 находится в черном списке!", Объект.Контрагент));
		Объект.Контрагент = Неопределено;   
	Иначе 
		объект.ИНН = ПолучитьИНН(Объект.Контрагент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаценкаПриИзменении(Элемент)
	Если Наценка <> 0  тогда
		для каждого Строка из объект.Товары цикл   
			Строка.Цена =  Строка.Цена* (1 + Наценка/100);
			Строка.Сумма = Строка.Цена * Строка.Количество ;  
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти    

&НаСервереБезКонтекста
Функция ПолучитьИНН(Контрагент)
	Возврат Контрагент.ИНН
КонецФункции
